In [8]:
import pandas as pd

friends = [{'age': 15, 'job': 'student'},
         {'age': 25, 'job': 'developer'},
         {'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friends, index = ['John', 'Jenny', 'Nate'], columns = ['age', 'job'])
df

       age        job
John    15    student
Jenny   25  developer
Nate    30    teacher

In [6]:
df.drop(['John','Nate']) # df.drop(['John','Nate'], inplace = True ) 로 저장을 새로하지않고 바로 적용 가능

       age        job
Jenny   25  developer

In [10]:
friends = [{'name': 'Jone', 'age': 15, 'job': 'student'},
         {'name': 'Ben', 'age': 25, 'job': 'developer'},
         {'name': 'Jenny', 'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friends, columns = ['name','age','job'])
df

    name  age        job
0   Jone   15    student
1    Ben   25  developer
2  Jenny   30    teacher

In [12]:
df.drop(df.index[[0,2]]) # 인덱스로 삭제

  name  age        job
1  Ben   25  developer

In [14]:
df[df.age > 20] # 20살 이상만 조회

    name  age        job
1    Ben   25  developer
2  Jenny   30    teacher

In [15]:
df.drop('age', axis = 1) # axis = 1 은 컬럼 중에서라는 의미. age만 삭제

    name        job
0   Jone    student
1    Ben  developer
2  Jenny    teacher

In [16]:
df.drop('age', axis = 1, inplace = True)

In [17]:
df

    name        job
0   Jone    student
1    Ben  developer
2  Jenny    teacher